app/views/lectures/_form.html.erb

SELECT `courses`.* FROM `courses` ORDER BY `courses`.`title` ASC
---

    <%= form.collection_select :course_id,Course.order(:title),:id,:title %>