app/views/lectures/index.html.erb

SELECT  1 AS one FROM `users` INNER JOIN `lectures_users` ON `users`.`id` = `lectures_users`.`user_id` WHERE `lectures_users`.`lecture_id` = 1 AND `users`.`id` = 1 LIMIT 1
---

        <% if (!lecture.users.include? current_user) %>