app/controllers/lectures_controller.rb

  def upvote
    @lecture = Lecture.find(params[:id])
---
SELECT  `lectures`.* FROM `lectures` WHERE `lectures`.`id` = 1 LIMIT 1

  def spam
    current_user.lectures << Lecture.find(params[:id])
---
SELECT  `lectures`.* FROM `lectures` WHERE `lectures`.`id` = 1 LIMIT 1